cases/2D/method_comparison/2D_dambreak_Bn0p10_hr1_purePapan/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application     interIsoFoam;
libs ("libPapanastasiouViscosity.so");
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1200;
deltaT          5e-5;
writeControl    adjustable;
writeInterval   8;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable yes;
adjustTimeStep  yes;
maxCo           0.5;
maxAlphaCo      0.5;
maxDeltaT       0.1;
