cases/2D/method_comparison/2D_dambreak_Bn0p10_hr1_purePapan/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
scale 1;
// CONVERGENCE seviyesi: L2_dx0p02  (domain 5 x 1.6, dx=dy=dz uniform)  hucre = 1 x 250 x 80
vertices ( (0 0 0) (0.1 0 0) (0.1 5 0) (0 5 0) (0 0 1.6) (0.1 0 1.6) (0.1 5 1.6) (0 5 1.6) );
blocks ( hex (0 1 2 3 4 5 6 7) (1 250 80) simpleGrading (1 1 1) );
edges ();
boundary
(
    lowerWall   { type wall;          faces ( (0 3 2 1) ); }
    atmosphere  { type patch;         faces ( (4 5 6 7) ); }
    rightWall   { type wall;          faces ( (3 7 6 2) ); }
    leftWall    { type symmetryPlane; faces ( (0 1 5 4) ); }
    frontAndBack{ type empty;         faces ( (0 4 7 3) (1 2 6 5) ); }
);
mergePatchPairs ();
