cases/2D/method_comparison/2D_dambreak_Bn0p10_hr1_purePapan/constant/dynamicMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object dynamicMeshDict; }
dynamicFvMesh staticFvMesh;
